TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_900/STM32_WPAN/App/app_sidewalk.c
/**
  ******************************************************************************
  * @file    app_sidewalk.c
  * @brief   Sidewalk SubGHz link sample app implementation
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

 /* Includes ------------------------------------------------------------------*/
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "app_freertos.h"

#include <sid_api.h>
#include <sid_hal_reset_ifc.h>
#include <sid_log_control.h>
#include <sid_pal_assert_ifc.h>
#include <sid_pal_common_ifc.h>
#include <sid_pal_delay_ifc.h>
#include <sid_pal_gpio_ifc.h>
#include <sid_pal_log_ifc.h>
#include <sid_900_cfg.h>
#include <sid_stm32_common_utils.h>

#include SID_APP_VERSION_HEADER
#include <sid_sdk_version.h>

#include "target/memory.h"

#include "app_ble_config.h"
#include "app_900_config.h"
#include "app_common.h"
#include <stm32_mcu_info.h>
#if CFG_LED_SUPPORTED
#  include "led_indication.h"
#endif /* CFG_LED_SUPPORTED */
#include "sid_pal_gpio_ext_ifc.h"
#include <stm32wlxx_app_radio_ext_ifc.h>
#if defined(NUCLEO_WBA52_BOARD) || defined(NUCLEO_WBA55_BOARD) || defined(NUCLEO_WBA65_BOARD)
#  include "stm32wbaxx_nucleo.h"
#endif

#if (CFG_LPM_LEVEL != 0)
#  include "stm32_lpm.h"
#endif /* (CFG_LPM_LEVEL != 0) */
#if (CFG_BUTTON_SUPPORTED != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
#  include <sid_pal_gpio_ext_ifc.h>
#endif /* (CFG_BUTTON_SUPPORTED != 0) && (CFG_LPM_STDBY_SUPPORTED != 0) */

/* Private defines -----------------------------------------------------------*/

#define SID_MSG_QUEUE_LEN                           (10u)

#define DEMO_MESSAGE_DELAY_MS                       (60000u)

#define BUTTON_LONG_PRESS_MS                        (1500u)
#define BUTTON_TIMESTAMP_INVALID_VAL                (0u)

/* Select Sidewalk link type for communication - LoRa or FSK */
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 && !SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
#  define SID_COMM_LINK_TYPE                        SID_LINK_TYPE_2 /* FSK link */
#elif SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
#  define SID_COMM_LINK_TYPE                        SID_LINK_TYPE_3 /* LoRa link */
#else
#  error "Invalid configuration. This sample app is designed to use either FSK or LoRa Sidewalk links for normal operation"
#endif

/* Select Sidewalk link type for initial device registration - BLE or FSK */
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_1
#  define SID_REGISTRATION_LINK_TYPE                SID_LINK_TYPE_1 /* BLE link */
#elif SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 && !SID_SDK_CONFIG_ENABLE_LINK_TYPE_1
#  define SID_REGISTRATION_LINK_TYPE                SID_LINK_TYPE_2 /* FSK link */
#else
#  error "Sidewalk device registration is only possible via BLE or FSK link, but none of them is enabled in the configuration"
#endif

#if !SID_SDK_CONFIG_ENABLE_LINK_TYPE_1 && SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 && !SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
#  define SID_FSK_ONLY_LINK                         (1)
#else
#  define SID_FSK_ONLY_LINK                         (0)
#endif

/* Private macro -----------------------------------------------------------*/

#define OS_MS_TO_TICKS( xTimeInMs )                 ( ( uint32_t ) ( ( ( uint32_t ) ( xTimeInMs ) * ( uint32_t ) osKernelGetTickFreq() ) / ( uint32_t ) 1000U ) )

/* UART2 Command Protocol from STM32G0B1 */
#define UART2_CMD_INIT_LORA    0x01
#define UART2_CMD_SEND_DATA    0x02
#define UART2_CMD_STOP_LINK    0x03
#define UART2_CMD_GET_STATUS   0x04

/* Private typedef -----------------------------------------------------------*/

enum event_type
{
    EVENT_TYPE_COLD_START_LINK,
    EVENT_TYPE_HOT_START_LINK,
    EVENT_TYPE_STOP_LINK,
    EVENT_TYPE_TOGGLE_LINK,
    EVENT_TYPE_SIDEWALK,
    EVENT_TYPE_SEND_HELLO,
    EVENT_TYPE_UART2_DATA,
    EVENT_FACTORY_RESET,
    EVENT_TYPE_SET_DEVICE_PROFILE,
    EVENT_TYPE_REGISTRATION_COMPLETED,
#if (CFG_LPM_STDBY_SUPPORTED != 0)
    EVENT_TYPE_ACTIVE_STANDBY,
    EVENT_TYPE_FULL_STANDBY,
#endif /* CFG_LPM_STDBY_SUPPORTED */
};

enum app_state
{
    STATE_INIT,
    STATE_SIDEWALK_READY,
    STATE_SIDEWALK_NOT_READY,
    STATE_SIDEWALK_SECURE_CONNECTION,
};

struct link_status
{
    uint32_t link_mask;
    uint32_t supported_link_mode[SID_LINK_TYPE_MAX_IDX];
};

typedef struct app_context
{
    osThreadId_t main_task;
    osMessageQueueId_t event_queue;
    struct sid_handle *sidewalk_handle;
    enum app_state state;
    struct link_status link_status;
    uint8_t counter;
} app_context_t;

enum sid_subghz_profile_idx {
    SID_LORA_PROFILE_A         = 0,
    SID_LORA_PROFILE_B         = 1,
    SID_FSK_PROFILE_1          = 2,
    SID_FSK_PROFILE_2          = 3,
    SID_SUBGHZ_PROFILE_UNKNOWN = 4,
    PROFILE_LAST               = SID_SUBGHZ_PROFILE_UNKNOWN,
};

typedef __PACKED_UNION {
    __PACKED_STRUCT {
        uint8_t build;
        uint8_t patch;
        uint8_t minor;
        uint8_t major;
    };
    uint32_t raw;
} hal_version_info_t;

/* Private variables ---------------------------------------------------------*/

static osMessageQueueId_t g_event_queue;

static osSemaphoreId_t registration_ready_semaphore;
static osSemaphoreId_t connection_ready_semaphore;
static osThreadId_t demo_counter_task;

/* Indicates if Sidewalk registration process is pending */
static bool registration_pending = false;

/* UART2 data buffer for forwarding to Sidewalk */
static uint8_t uart2_tx_buffer[20];
static uint8_t uart2_tx_len;

/* Private constants ---------------------------------------------------------*/

static const osThreadAttr_t sidewalk_stack_task_attributes = {
    .name         = "Sidewalk Stack Task",
    .priority     = SID_MAIN_TASK_PRIO,
    .stack_size   = SID_MAIN_TASK_STACK_SIZE,
    .attr_bits    = TASK_DEFAULT_ATTR_BITS,
    .cb_mem       = TASK_DEFAULT_CB_MEM,
    .cb_size      = TASK_DEFAULT_CB_SIZE,
    .stack_mem    = TASK_DEFAULT_STACK_MEM,
};

static const osSemaphoreAttr_t registration_ready_sem_attributes = {
    .name       = "Sidewalk Registration Semaphore",
    .attr_bits  = TASK_DEFAULT_ATTR_BITS,
    .cb_mem     = TASK_DEFAULT_CB_MEM,
    .cb_size    = TASK_DEFAULT_CB_SIZE,
};

static const osSemaphoreAttr_t connection_ready_sem_attributes = {
    .name       = "Connection Ready Semaphore",
    .attr_bits  = TASK_DEFAULT_ATTR_BITS,
    .cb_mem     = TASK_DEFAULT_CB_MEM,
    .cb_size    = TASK_DEFAULT_CB_SIZE,
};

