TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_900/STM32_WPAN/App/app_sidewalk.c
/*----------------------------------------------------------------------------*/

static void on_sidewalk_factory_reset(void *context)
{
    (void)context;

    SID_PAL_LOG_INFO("Factory reset notification received from sid api");
    (void)sid_hal_reset(SID_HAL_RESET_NORMAL);
}

/*----------------------------------------------------------------------------*/

static void send_ping(app_context_t *app_context)
{
    SID_PAL_LOG_INFO("Sending ping...");
    if (app_context->state == STATE_SIDEWALK_READY ||
        app_context->state == STATE_SIDEWALK_SECURE_CONNECTION)
    {
        SID_PAL_LOG_INFO("Sending counter update: %d", app_context->counter);
        struct sid_msg msg = {.data = (uint8_t*)&app_context->counter, .size = sizeof(uint8_t)};
        struct sid_msg_desc desc = {
            .type = SID_MSG_TYPE_NOTIFY,
            .link_type = SID_LINK_TYPE_ANY,
            .link_mode = SID_LINK_MODE_CLOUD,
        };

        if ((app_context->link_status.link_mask & SID_LINK_TYPE_1) &&
            (app_context->link_status.supported_link_mode[SID_LINK_TYPE_1_IDX] & SID_LINK_MODE_MOBILE))
        {
            desc.link_mode = SID_LINK_MODE_MOBILE;
        }

        sid_error_t ret = sid_put_msg(app_context->sidewalk_handle, &msg, &desc);
        if (ret != SID_ERROR_NONE)
        {
            SID_PAL_LOG_ERROR("Failed queueing data, err:%d", (int) ret);
#if CFG_LED_SUPPORTED
            (void)led_indication_set(LED_INDICATE_SEND_ERROR);
#endif /* CFG_LED_SUPPORTED */
        }
        else
        {
            SID_PAL_LOG_DEBUG("Queued data message id:%u", desc.id);
#if CFG_LED_SUPPORTED
            (void)led_indication_set(LED_INDICATE_SEND_ENQUEUED);
#endif /* CFG_LED_SUPPORTED */
        }
        app_context->counter++;
    }
    else
    {
        SID_PAL_LOG_WARNING("Send_ping: Sidewalk is not ready yet!");
#if CFG_LED_SUPPORTED
        (void)led_indication_set(LED_INDICATE_SEND_ERROR);
#endif /* CFG_LED_SUPPORTED */
    }
}

static void send_uart2_data(app_context_t *app_context)
{
    (void)app_context;
    SID_PAL_LOG_INFO("Sending UART2 data via UDT (%d bytes)", uart2_tx_len);
    SID_PAL_HEXDUMP(SID_PAL_LOG_SEVERITY_INFO, uart2_tx_buffer, uart2_tx_len);

    sid_error_t ret = sid_pal_radio_stm32wlxx_send_user_data(uart2_tx_buffer, uart2_tx_len, 0);
    if (ret != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("UDT send failed, err:%d", (int)ret);
    }
    else
    {
        SID_PAL_LOG_INFO("UDT data sent to WL55");
    }
}

static void parse_uart2_command(app_context_t *app_context)
{
    if (uart2_tx_len < 1) return;

    uint8_t cmd = uart2_tx_buffer[0];
    uint8_t payload_len = (uart2_tx_len > 1) ? uart2_tx_buffer[1] : 0;

    SID_PAL_LOG_INFO("UART2 CMD: 0x%02X, payload_len: %d", cmd, payload_len);

    switch (cmd)
    {
        case UART2_CMD_INIT_LORA:
            SID_PAL_LOG_INFO("CMD: INIT_LORA received from G0B1");
            if (app_context->sidewalk_handle == NULL)
            {
                queue_event(g_event_queue, EVENT_TYPE_COLD_START_LINK);
            }
            else
            {
                SID_PAL_LOG_WARNING("Sidewalk already initialized, ignoring INIT_LORA");
            }
            break;

        case UART2_CMD_SEND_DATA:
            SID_PAL_LOG_INFO("CMD: SEND_DATA (%d bytes) from G0B1", payload_len);
            /* Shift payload: skip cmd + len bytes */
            memmove(uart2_tx_buffer, &uart2_tx_buffer[2], payload_len);
            uart2_tx_len = payload_len;
            send_uart2_data(app_context);
            break;

        case UART2_CMD_STOP_LINK:
            SID_PAL_LOG_INFO("CMD: STOP_LINK received from G0B1");
            queue_event(g_event_queue, EVENT_TYPE_STOP_LINK);
            break;

        case UART2_CMD_GET_STATUS:
            SID_PAL_LOG_INFO("CMD: GET_STATUS - state=%d, handle=%s",
                app_context->state,
                (app_context->sidewalk_handle != NULL) ? "active" : "null");
            break;

        default:
            SID_PAL_LOG_ERROR("UART2: Unknown command 0x%02X", cmd);
            break;
    }
}

/*----------------------------------------------------------------------------*/

static void factory_reset(app_context_t * const context)
{
    /* Validate inputs */
    if (NULL == context)
    {
        SID_PAL_LOG_ERROR("Factory reset request failed - context cannot be null");
        return;
    }

    sid_error_t ret = sid_set_factory_reset(context->sidewalk_handle);
    if (ret != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Factory reset request failed: %d", (int32_t)ret);
    }
    else
    {
        SID_PAL_LOG_DEBUG("Factory reset initiated");
    }
}

/*----------------------------------------------------------------------------*/

static void print_subghz_link_profile(const app_context_t * const context)
{
    sid_error_t ret;
    struct sid_device_profile dev_cfg;

    do
    {
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
        dev_cfg.unicast_params.device_profile_id = SID_LINK3_PROFILE_A;
#elif SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
        dev_cfg.unicast_params.device_profile_id = SID_LINK2_PROFILE_2;
#else
        ret = SID_ERROR_NOSUPPORT;
        break;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */

        ret = sid_option(context->sidewalk_handle, SID_OPTION_900MHZ_GET_DEVICE_PROFILE, &dev_cfg, sizeof(dev_cfg));
        if (ret != SID_ERROR_NONE)
        {
            break;
        }

        SID_PAL_LOG_INFO("Current Sidewalk SubGHz mode: %s, rx_wndw_cnt: %u, wkup_type: %s, rx_interv: %ums",
                         sid_subghz_profile_code_to_str(dev_cfg.unicast_params.device_profile_id),
                         (uint32_t)dev_cfg.unicast_params.rx_window_count,
                         dev_cfg.unicast_params.wakeup_type < SID_STM32_UTIL_ARRAY_SIZE(sid_subghz_wakeup_type_strings) ? sid_subghz_wakeup_type_strings[dev_cfg.unicast_params.wakeup_type] : "Unknown",
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
                         (uint32_t)dev_cfg.unicast_params.unicast_window_interval.async_rx_interval_ms
#else
                         (uint32_t)dev_cfg.unicast_params.unicast_window_interval.sync_rx_interval_ms
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
        );

        ret = SID_ERROR_NONE;
    } while (0);

    if (ret != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to get Sidewalk SubGHz link profile info. Error %d", (int32_t)ret);
    }
}

