TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_900/STM32_WPAN/App/app_sidewalk.c
    struct sid_config config = {
        .link_mask           = 0u,
        .callbacks           = &event_callbacks,
        .link_config         = app_get_sidewalk_ble_config(),
        .sub_ghz_link_config = app_get_sub_ghz_config(),
    };

    /* Performing a cold start of the Sidewalk since device registration status is unknown at this point */
    queue_event(g_event_queue, EVENT_TYPE_COLD_START_LINK);

    while (1)
    {
        enum event_type event;

        if (osMessageQueueGet (app_context->event_queue, &event, 0u, osWaitForever) == osOK)
        {
            switch (event)
            {
                case EVENT_TYPE_COLD_START_LINK:
                    /* Performing a cold start of the Sidewalk since device registration status is unknown at this point */
                    if (NULL == app_context->sidewalk_handle)
                    {
                        ret = init_and_start_link(app_context, &config, true);
                        if (ret != SID_ERROR_NONE)
                        {
                            SID_PAL_LOG_ERROR("Failed to initialize Sidewalk. Error code: %d", (int)ret);
                            goto error;
                        }
                    }
                    else
                    {
                        /* Skip the request, Sidewalk is already running */
                    }
                    break;

                case EVENT_TYPE_HOT_START_LINK:
                    /* Performing a hot start of the Sidewalk */
                    if (NULL == app_context->sidewalk_handle)
                    {
                        ret = init_and_start_link(app_context, &config, false);
                        if (ret != SID_ERROR_NONE)
                        {
                            SID_PAL_LOG_ERROR("Failed to initialize Sidewalk. Error code: %d", (int)ret);
                            goto error;
                        }
                    }
                    else
                    {
                        /* Skip the request, Sidewalk is already running */
                    }
                    break;

                case EVENT_TYPE_TOGGLE_LINK:
                    if(app_context->sidewalk_handle == NULL)
                    {
                        queue_event(g_event_queue, (false == registration_pending) ? EVENT_TYPE_HOT_START_LINK : EVENT_TYPE_COLD_START_LINK);
                    }
                    else
                    {
                        queue_event(g_event_queue, EVENT_TYPE_STOP_LINK);
                    }
                    break;

                case EVENT_TYPE_STOP_LINK:
                    if (app_context->sidewalk_handle != NULL)
                    {
                        ret = destroy_link(app_context, &config);
                        SID_PAL_ASSERT(ret == SID_ERROR_NONE);
                    }
                    break;

                case EVENT_TYPE_SIDEWALK:
                    if ((NULL == app_context) || (NULL == app_context->sidewalk_handle))
                    {
                        /*  This may happen if Sidewalk link was terminated but the event queue already contained some events - just ignore them */
                        break;
                    }
                    ret = sid_process(app_context->sidewalk_handle);
                    if ((ret != SID_ERROR_NONE) && (ret != SID_ERROR_STOPPED))
                    {
                        SID_PAL_LOG_ERROR("Error processing Sidewalk event, err:%d", (int)ret);
                        goto error;
                    }
                    else if (SID_ERROR_STOPPED == ret)
                    {
                        SID_PAL_LOG_DEBUG("Sidewalk processing discarded - Sidewalk stack is stopped");
                    }
                    else
                    {
                        /* Nothing to do, everything is fine */
                    }
                    break;

                case EVENT_TYPE_SEND_HELLO:
                    SID_PAL_LOG_INFO("EVENT_TYPE_SEND_HELLO");

                    if (app_context->state == STATE_SIDEWALK_READY)
                    {
                        send_ping(app_context);
                    }
                    else
                    {
                        SID_PAL_LOG_DEBUG("Sidewalk not ready!");;
                    }
                    break;

                case EVENT_TYPE_UART2_DATA:
                    SID_PAL_LOG_INFO("EVENT_TYPE_UART2_DATA");
                    parse_uart2_command(app_context);
                    break;

                case EVENT_TYPE_SET_DEVICE_PROFILE:
                    {
                        SID_PAL_LOG_INFO("EVENT_TYPE_SET_DEVICE_PROFILE");
                        struct sid_device_profile set_dp_cfg = {};
                        struct sid_device_profile dev_cfg;

#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
                        dev_cfg.unicast_params.device_profile_id = SID_LINK3_PROFILE_A;
#elif SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
                        dev_cfg.unicast_params.device_profile_id = SID_LINK2_PROFILE_2;
#else
                        SID_PAL_LOG_ERROR("SubGHz profile switch failed - unknown link mode");
                        break;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */

                        sid_option(app_context->sidewalk_handle, SID_OPTION_900MHZ_GET_DEVICE_PROFILE, &dev_cfg, sizeof(dev_cfg));

#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
                        if (SID_LINK3_PROFILE_A == dev_cfg.unicast_params.device_profile_id)
                        {
                            set_dp_cfg.unicast_params.device_profile_id = SID_LINK3_PROFILE_B;
                            set_dp_cfg.unicast_params.rx_window_count   = SID_RX_WINDOW_CNT_INFINITE;
                            set_dp_cfg.unicast_params.wakeup_type       = SID_TX_AND_RX_WAKEUP;
                            set_dp_cfg.unicast_params.unicast_window_interval.async_rx_interval_ms = SID_LINK3_RX_WINDOW_SEPARATION_3;
                        }
                        else if (SID_LINK3_PROFILE_B == dev_cfg.unicast_params.device_profile_id)
                        {
                            set_dp_cfg.unicast_params.device_profile_id = SID_LINK3_PROFILE_A;
                            set_dp_cfg.unicast_params.rx_window_count   = SID_RX_WINDOW_CNT_2;
                            set_dp_cfg.unicast_params.wakeup_type       = SID_TX_AND_RX_WAKEUP;
                            set_dp_cfg.unicast_params.unicast_window_interval.async_rx_interval_ms = SID_LINK3_RX_WINDOW_SEPARATION_3;
                        }
                        else
#elif SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
                        if (SID_LINK2_PROFILE_1 == dev_cfg.unicast_params.device_profile_id)
                        {
                            set_dp_cfg.unicast_params.device_profile_id    = SID_LINK2_PROFILE_2;
                            set_dp_cfg.unicast_params.rx_window_count      = SID_RX_WINDOW_CNT_INFINITE;
                            set_dp_cfg.unicast_params.beacon_interval_unit = 1u;
                            set_dp_cfg.unicast_params.wakeup_type          = SID_TX_AND_RX_WAKEUP;
                            set_dp_cfg.unicast_params.unicast_window_interval.sync_rx_interval_ms = SID_LINK2_RX_WINDOW_SEPARATION_2;
                        }
                        else if (SID_LINK2_PROFILE_2 == dev_cfg.unicast_params.device_profile_id)
                        {
                            set_dp_cfg.unicast_params.device_profile_id    = SID_LINK2_PROFILE_1;
                            set_dp_cfg.unicast_params.rx_window_count      = SID_RX_WINDOW_CNT_INFINITE;
                            set_dp_cfg.unicast_params.beacon_interval_unit = 1u;
                            set_dp_cfg.unicast_params.wakeup_type          = SID_TX_AND_RX_WAKEUP;
                            set_dp_cfg.unicast_params.unicast_window_interval.sync_rx_interval_ms = SID_LINK2_RX_WINDOW_SEPARATION_1;
                        }
                        else
#else
                        {
                            SID_PAL_LOG_ERROR("Unsupported SubGHz link profile - %s (%u)",
                                              sid_subghz_profile_code_to_str(dev_cfg.unicast_params.device_profile_id),
                                              (uint32_t)dev_cfg.unicast_params.device_profile_id);
                            break;
                        }
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */

                        SID_PAL_LOG_INFO("Changing Sidewalk SubGHz link mode: %s -> %s, rx_interval %u",
                                         sid_subghz_profile_code_to_str(dev_cfg.unicast_params.device_profile_id),
                                         sid_subghz_profile_code_to_str(set_dp_cfg.unicast_params.device_profile_id),
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
                                         (uint32_t)set_dp_cfg.unicast_params.unicast_window_interval.async_rx_interval_ms
#else
                                         (uint32_t)set_dp_cfg.unicast_params.unicast_window_interval.sync_rx_interval_ms
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */
                        );

                        ret = set_device_profile(app_context, &set_dp_cfg);
                        if (SID_ERROR_NONE == ret)
                        {
                            SID_PAL_LOG_INFO("Successfully switched Sidewalk SubGHz mode to %s",
                                             sid_subghz_profile_code_to_str(set_dp_cfg.unicast_params.device_profile_id));
                        }
                        else
                        {
                            SID_PAL_LOG_ERROR("Failed to switch Sidewalk SubGHz link mode to %s. Error %d",
                                              sid_subghz_profile_code_to_str(set_dp_cfg.unicast_params.device_profile_id),
                                              (int32_t)ret);
                        }
                    }
                    break;

                case EVENT_TYPE_REGISTRATION_COMPLETED:
#if SID_FSK_ONLY_LINK
                    /* Stack re-initialization is not required, we are in the FSK mode already */
#else
                    /* Switch to SubGHz-only configuration since device registration is done */
                    ret = sid_deinit(app_context->sidewalk_handle);
                    if (ret != SID_ERROR_NONE)
                    {
                        SID_PAL_LOG_ERROR("Failed to deinitialize Sidewalk, link_mask:%x, err:%d", (int32_t)config.link_mask, (int32_t)ret);
                        break;
                    }

                    config.link_mask = SID_COMM_LINK_TYPE;
                    ret = sid_init(&config, &app_context->sidewalk_handle);
                    if (ret != SID_ERROR_NONE)
                    {
                        SID_PAL_LOG_ERROR("Failed to initialize Sidewalk link_mask:%x, err:%d", (int32_t)config.link_mask, (int32_t)ret);
                        break;
                    }

#  if (SID_SDK_CONFIG_ENABLE_LINK_TYPE_2)
                    /* Reduce log level for FSK connection since it produces excessive logs that affect communication timings */
                    adjust_sidewalk_link_log_level(config.link_mask);
#  endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */

                    ret = sid_start(app_context->sidewalk_handle, config.link_mask);
                    if (ret != SID_ERROR_NONE)
                    {
                        SID_PAL_LOG_ERROR("Failed to start Sidewalk stack, link_mask:%x, err:%d", (int32_t)config.link_mask, (int32_t)ret);
                        break;
                    }
#endif /* SID_FSK_ONLY_LINK */

                    /* Indicate to the app that Sidewalk device registration is completed */
                    os_status = osSemaphoreRelease(registration_ready_semaphore);
                    if (os_status != osOK)
                    {
                        SID_PAL_LOG_ERROR("Failed to indicate Sidewalk registration completion. Error code : %d", (int32_t)os_status);
                        goto error;
                    }
                    break;

