TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_900/STM32_WPAN/App/app_sidewalk.c
        while ((STATE_SIDEWALK_READY == app_context->state) || (STATE_SIDEWALK_SECURE_CONNECTION == app_context->state))
        {
            SID_PAL_LOG_INFO("Demo Counter Thread: sending out counter update");
            queue_event(g_event_queue, EVENT_TYPE_SEND_HELLO);
            osDelay(DEMO_MESSAGE_DELAY_MS);
            SID_PAL_LOG_INFO("Demo Counter Thread: sending out counter update - DONE");
        }

        SID_PAL_LOG_DEBUG("Demo Counter Thread: Sidewalk connection lost");
    }

error:
    SID_PAL_LOG_INFO("Demo Counter Thread: Terminated due to error");
    SID_PAL_LOG_FLUSH();
    Error_Handler();

    /* Normally the lines below are not reachable, but keep them if Error_Handler somehow returns */
    demo_counter_task = NULL;
    osThreadExit();
}

/*----------------------------------------------------------------------------*/

#if SID_PAL_LOG_ENABLED
static const char * sid_subghz_profile_code_to_str(enum sid_device_profile_id code)
{
    const char * profile_str = NULL;

#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
    assert_param(code >= SID_LINK3_PROFILE_A);
    assert_param(code < SID_LINK3_PROFILE_LAST);
#elif SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
    assert_param(code >= SID_LINK2_PROFILE_1);
    assert_param(code < SID_LINK2_PROFILE_LAST);
#else
    assert_param(0); /* Invalid configuration */
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */

    /*Converting from sid_profile_id to index*/
    switch (code)
    {
#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
        case SID_LINK3_PROFILE_A:
            profile_str = sid_subghz_profile_strings[SID_LORA_PROFILE_A];
            break;

        case SID_LINK3_PROFILE_B:
            profile_str = sid_subghz_profile_strings[SID_LORA_PROFILE_B];
            break;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_3 */

#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2
        case SID_LINK2_PROFILE_1:
            profile_str = sid_subghz_profile_strings[SID_FSK_PROFILE_1];
            break;

        case SID_LINK2_PROFILE_2:
            profile_str = sid_subghz_profile_strings[SID_FSK_PROFILE_2];
            break;
#endif /* SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 */

        default:
            profile_str = sid_subghz_profile_strings[SID_SUBGHZ_PROFILE_UNKNOWN];
            break;
    }

    return profile_str;
}
#endif /* SID_PAL_LOG_ENABLED */

/* UDT callback - data received from WL55 via SPI */
static void _on_wl55_user_data(const uint8_t * const data, const uint32_t data_len, void * user_arg)
{
    (void)user_arg;
    SID_PAL_LOG_INFO("UDT from WL55 (%u bytes): %.*s", data_len, data_len, (const char *)data);
    SID_PAL_HEXDUMP(SID_PAL_LOG_SEVERITY_INFO, data, data_len);
}

/* Global function definitions -----------------------------------------------*/

void SID_APP_Init(void)
{
    /* Adjust Sidewalk log level dynamically - this is needed if the firmware is compiled using
     * Sidewalk SDK static library and the library was assembled with different debug level
     */
    struct sid_log_control_severity sid_log_settings;
    sid_log_control_get_severity(&sid_log_settings);
    if (SID_PAL_LOG_LEVEL != sid_log_settings.level)
    {
        sid_log_settings.level = SID_PAL_LOG_LEVEL;
        sid_log_control_set_severity(&sid_log_settings);
    }

    /* Printout application version info */
    SID_PAL_LOG_INFO("Application name: %s", SID_APP_PROJECT_NAME);
    SID_PAL_LOG_INFO("Application version %s", SID_APP_PROJECT_VERSION_STRING);
    SID_PAL_LOG_INFO("Application build type: %s", SID_APP_PROJECT_BUILD_TYPE);
    SID_PAL_LOG_INFO("Application commit hash: %s", SID_APP_PROJECT_COMMIT_HASH_STRING);
    SID_PAL_LOG_INFO("Application commit description: %s", SID_APP_PROJECT_COMMIT_DESCRIPTION);
    SID_PAL_LOG_INFO("Sidewalk SDK: %u.%u.%u-%u", SID_SDK_MAJOR_VERSION, SID_SDK_MINOR_VERSION, SID_SDK_PATCH_VERSION, SID_SDK_BUILD_VERSION);
    SID_PAL_LOG_INFO("FreeRTOS Kernel: %s", tskKERNEL_VERSION_NUMBER);

    /* CubeMX pack version */
    const hal_version_info_t cubemx_fw_pack_ver = {
        .raw = HAL_GetHalVersion(),
    };
    SID_PAL_LOG_INFO("STM32CubeWBA: %u.%u.%u", cubemx_fw_pack_ver.major, cubemx_fw_pack_ver.minor, cubemx_fw_pack_ver.patch);

    /* Printout MCU details */
    stm32_mcu_info_t mcu_info = stm32_mcu_info_describe_host();
    SID_PAL_LOG_INFO("Host MCU: %s (0x%X), revision: %s (0x%X)", mcu_info.device_name, mcu_info.device_id, mcu_info.rev_name, mcu_info.rev_id);

    platform_parameters_t platform_parameters = {
        .mfg_store_region.addr_start = MANUFACTURE_FLASH_START,
        .mfg_store_region.addr_end   = MANUFACTURE_FLASH_END,

#if SID_SDK_CONFIG_ENABLE_LINK_TYPE_2 || SID_SDK_CONFIG_ENABLE_LINK_TYPE_3
        .platform_init_parameters.radio_cfg = get_radio_cfg(),
#endif
    };

    sid_error_t ret_code = sid_platform_init(&platform_parameters);
    if (ret_code != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Sidewalk Platform Init err: %d", ret_code);
        SID_PAL_ASSERT(0);
    }

    /* Register UDT callback to receive data from WL55 */
    ret_code = sid_pal_radio_stm32wlxx_set_user_data_received_cb(_on_wl55_user_data, NULL);
    if (ret_code != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Failed to set UDT RX callback, err:%d", (int)ret_code);
    }
    else
    {
        SID_PAL_LOG_INFO("UDT RX callback registered");
    }

#if CFG_LED_SUPPORTED
    ret_code = led_indication_init();
    if (ret_code != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Sidewalk Init LED indication err: %d", ret_code);
        SID_PAL_ASSERT(0);
    }
#endif /* CFG_LED_SUPPORTED */

    g_event_queue = osMessageQueueNew(SID_MSG_QUEUE_LEN, sizeof(enum event_type), NULL);
    if (g_event_queue == NULL)
    {
        SID_PAL_LOG_ERROR("Can't create Sidewalk message queue. No memory");
        SID_PAL_ASSERT(0);
    }

    static app_context_t app_context = {
        .event_queue = NULL,
        .main_task = NULL,
        .sidewalk_handle = NULL,
        .state = STATE_INIT,
    };

#if (CFG_BUTTON_SUPPORTED == 1)
    buttons_init();
#endif /* (CFG_BUTTON_SUPPORTED == 1) */

    app_context.event_queue = g_event_queue;
    app_context.main_task = osThreadNew(sidewalk_stack_task_entry, &app_context, &sidewalk_stack_task_attributes);
    if (NULL == app_context.main_task)
    {
        SID_PAL_LOG_ERROR("Can't create Sidewalk processing thread. No memory");
        SID_PAL_ASSERT(0);
    }

    /* Create a semaphore to monitor Sidewalk registration status */
    registration_ready_semaphore = osSemaphoreNew(1u, 0u, &registration_ready_sem_attributes);
    if (NULL == registration_ready_semaphore)
    {
        SID_PAL_LOG_ERROR("Can't create Sidewalk Registration Status semaphore. No memory");
        SID_PAL_ASSERT(0);
    }

    /* Create a semaphore to monitor Sidewalk connection status */
    connection_ready_semaphore = osSemaphoreNew(1u, 0u, &connection_ready_sem_attributes);
    if (NULL == connection_ready_semaphore)
    {
        SID_PAL_LOG_ERROR("Can't create Sidewalk connection status semaphore. No memory");
        SID_PAL_ASSERT(0);
    }

    demo_counter_task = osThreadNew(demo_counter_task_entry, &app_context, &demo_counter_task_attributes);
    if (NULL == demo_counter_task)
    {
        SID_PAL_LOG_ERROR("Can't create Sidewalk demo thread. No memory");
        SID_PAL_ASSERT(0);
    }
}

/*----------------------------------------------------------------------------*/

void SID_APP_StandbyExit(void)
{
#if (CFG_BUTTON_SUPPORTED == 1)
    /* Restore GPIO and IRQ config for ther buttons */
    buttons_init();
#endif /* CFG_BUTTON_SUPPORTED */
}

void app_sidewalk_forward_uart2_data(const uint8_t *data, uint8_t len)
{
    if (len > sizeof(uart2_tx_buffer))
    {
        len = sizeof(uart2_tx_buffer);
    }
    memcpy(uart2_tx_buffer, data, len);
    uart2_tx_len = len;
    queue_event(g_event_queue, EVENT_TYPE_UART2_DATA);
}
